---
kind: type
id: T:Autodesk.Revit.DB.Visual.GradientType
source: html/24840051-8de9-699a-be97-4803c5aff530.htm
---
# Autodesk.Revit.DB.Visual.GradientType

The enumerated type representing the permitted values for the asset property "GradientType" from the "Gradient" schema.

## Syntax (C#)
```csharp
public enum GradientType
```